Revit 2027 API
PrimarySizeCriterion Constructor
 Constructs a PrimarySizeCriterion with a minimum and maximum size.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PrimarySizeCriterion(
	double minimumSize,
	double maximumSize
)
Public Sub New (
	minimumSize As Double,
	maximumSize As Double
)
public:
PrimarySizeCriterion(
	double minimumSize,
	double maximumSize
)
new :
        minimumSize : float *
        maximumSize : float -> PrimarySizeCriterion
Parameters
minimumSize Double
maximumSize Double
See Also
Reference
PrimarySizeCriterion Class
Autodesk.Revit.DB Namespace